{
    "headshot" : "images/ameesh3.jpeg",
    "about"    : "Hi! I'm currently a Ph.D student at UC Berkeley, where I'm advised by <a href=\"https://people.eecs.berkeley.edu/~sseshia/\">Sanjit Seshia</a>. My Ph.D. has been gratefully supported by the <a href=\"https://ndseg.sysplus.com/\">NDSEG Fellowship</a>.</p> <p>I research neuro-symbolic machine learning, with particular focus on applications in robotics, autonomy, and program synthesis. By integrating formal and logical symbolic structures into learning algorithms, I hope to improve the safety and reliability of ML-based systems.</p><p>I received my Bachelor's and Master's degrees from Rice University, where I worked on projects related to interpretable machine learning via program synthesis and formal methods. I was advised by <a href=\"https://www.cs.utexas.edu/~swarat/\">Swarat Chaudhuri</a>, who I worked with on the <a href=\"http://www.neurosymbolic.org/kickoff.html\">\"Understanding the World Through Code\" NSF Expeditions Project</a>. As an undergrad, I also collaborated with <a href=\"https://ankitlab.co/\">Ankit Patel</a> and <a href=\"https://richb.rice.edu/\">Richard Baraniuk</a>. I was fortunate to be supported by the <a href=\"https://csweb.rice.edu/academics/undergraduate-programs/advising/fifth-year-masters\">Rice CS Graduate Fellowship</a>.</p><p>I've spent time at Microsoft Research AI, where I worked with Alex Polozov and the <a href=]\"https://www.microsoft.com/en-us/research/group/grounded-reasoning-and-interactive-learning-grail/\">GRAIL group</a> on interactive ML-driven program synthesis. I also collaborated with Jon DeCastro and the Human-Aware AI team at <a href=\"https://www.tri.global/\">TRI</a> to improve learned behavior in safety-critical settings.</p> <p>In my free time, I enjoy doing a lot of things, including but not limited to: playing tennis, reading novels, inventing new recipes, and repeatedly fixing and breaking my jumpshot. I'm originally from Cleveland, Ohio, and I love watching my beloved Cavaliers break my heart year after year.</p>",

    "contact": "You can find me on <a href=\"https://x.com/ameeshsh\">X</a> or on <a href=\"https://scholar.google.com/citations?user=mfMAwVwAAAAJ&hl=en\">Google Scholar</a>. The best way to reach me is by sending me an email at ameesh@berkeley.edu."
   
}